/* date = July 24th 2022 6:30 pm */

#ifndef _BASE_H
#define _BASE_H

//~ NOTE(long): Context Cracking

#define ENABLE_ASSERT 1

//- NOTE(long): Compiler
#if defined(__clang__)
#define COMPILER_CLANG 1
#elif defined(_MSC_VER)
#define COMPILER_CL 1
#elif defined(__GNUC__)
#define COMPILER_GCC 1
#else
#error No context cracking for this compiler
#endif

#ifndef COMPILER_CL
#define COMPILER_CL 0
#endif
#ifndef COMPILER_CLANG
#define COMPILER_CLANG 0
#endif
#ifndef COMPILER_GCC
#define COMPILER_GCC 0
#endif

//- NOTE(long): OS
#ifdef _WIN32
#define OS_WIN 1
#elif defined(__gnu_linux__)
#define OS_LINUX 1
#elif defined(__APPLE__) && defined(__MACH__)
#define OS_MAC 1
#else
#error Missing OS detection
#endif

#ifndef OS_WIN
#define OS_WIN 0
#endif
#ifndef OS_LINUX
#define OS_LINUX 0
#endif
#ifndef OS_MAC
#define OS_MAC 0
#endif

// @RECONSIDER(long): Do I even need this?
#if COMPILER_CL && !OS_WIN
#error Missing ARCH detection
#endif

//- NOTE(long): Architecture
#if COMPILER_CL
#ifdef _M_AMD64
#define ARCH_X64 1
#elif defined(_M_I68)
#define ARCH_X86 1
#elif defined(_M_ARM)
#define ARCH_ARM 1
// TODO(long): ARM64
#else
#error Missing ARCH detection
#endif

// NOTE(long): While GCC and Clang have predefined macros for SSE, MSVC doesn't
// https://stackoverflow.com/questions/18563978/detect-the-availability-of-sse-sse2-instruction-set-in-visual-studio
#if (defined(_M_AMD64) || defined(_M_X64))
#define __SSE2__ //SSE2 x64
#elif _M_IX86_FP == 2
#define __SSE2__ //SSE2 x32

#define CompareMem(a, b, size) (memcmp((a), (b), (size)) == 0)
#define CompareArr(a, b) CompareMem((a), (b), Min(ArrayCount(a) * sizeof(*(a)), ArrayCount(b) * sizeof(*(b))))

#define C4(str) (*(u32*)(str))
#define ExpandC4(x) (i32)(sizeof(x)), (i8*)(&(x))

// @RECONSIDER(long)
#define Using(type, name, ...) for (b32 done = !Begin##type(__VA_ARGS__); !done; done = End##type(__VA_ARGS__))

//~ NOTE(long): Linked List Macros

#define PushBackDLL_NP(f, l, n, next, prev) (((f)==0?\
                                              (f)=(l)=(n):\
                                              ((l)->next=(n),(l)=(n))),\
                                             (n)->next=(n)->prev=0)
#define PushBackDLL(f, l, n) DLLPushBack_NP(f, l, n, next, prev)
#define PushFrontDLL(f, l, n) DLLPushBack_NP(l, f, n, prev, next)

#define DLLRemove_NP(f, l, n, next, prev) (((f)==(n)?\
                                            ((f)=(f)->next, (f)->prev=0):\
                                            (l)==(n)?\
                                            ((l)=(l)->prev,(l)->next=0):\
                                            ((n)->next->prev=(n)->prev,\
                                             (n)->prev->next=(n)->next)))
#define DLLRemove(f, l, n) DLLRemove_NP(f, l, n, next, prev)

#define SLLQueuePush(f, l, n) ((f)==0?\
                               (f)=(l)=(n):\
                               ((l)->next=(n),(l)=(n)),\
                               (n)->next=0)
#define SLLQueuePushFront(f, l, n) ((f)==0?\
                                    ((f)=(l)=(n),(n)->next=0):\
                                    ((n)->next=(f),(f)=(n)))
#define SLLQueuePop(f, l) ((f)==(l)?\
                           (f)=(l)=0:\
                           (f)=(f)->next)

#define SLLStackPush(f, n) ((n)->next=(f),(f)=(n))
#define SLLStackPop(f) ((f)==0?0:((f)=(f)->next))

//~ NOTE(long): Basic Types

#if COMPILER_CL
// https://learn.microsoft.com/vi-vn/cpp/cpp/int8-int16-int32-int64?view=msvc-160
#define  __INT8_TYPE__ __int8
#define __INT16_TYPE__ __int16
#define __INT32_TYPE__ __int32
#define __INT64_TYPE__ __int64

// C:\Program Files (x86)\Microsoft Visual Studio\2019\Community\VC\Tools\MSVC\14.29.30133\include\vcruntime.h
#if ARCH_SIZE == 64
#define __INTPTR_TYPE__ __int64
#else
#define __INTPTR_TYPE__ __int32
#endif

#define   __UINT8_TYPE__ unsigned __INT8_TYPE__ 
#define  __UINT16_TYPE__ unsigned __INT16_TYPE__
#define  __UINT32_TYPE__ unsigned __INT32_TYPE__
#define  __UINT64_TYPE__ unsigned __INT64_TYPE__
#define __UINTPTR_TYPE__ unsigned __INTPTR_TYPE__
#endif

// https://github.com/gcc-mirror/gcc/blob/master/gcc/ginclude/stdint-gcc.h
// https://gcc.gnu.org/onlinedocs/cpp/Common-Predefined-Macros.html
typedef    __INT8_TYPE__ i8;
typedef   __INT16_TYPE__ i16;
typedef   __INT32_TYPE__ i32;
typedef   __INT64_TYPE__ i64;
typedef   __UINT8_TYPE__ u8;
typedef  __UINT16_TYPE__ u16;
typedef  __UINT32_TYPE__ u32;
typedef  __UINT64_TYPE__ u64;
typedef  __INTPTR_TYPE__ iptr;
typedef __UINTPTR_TYPE__ uptr;

StaticAssert(sizeof(i8 ) == 1,  CheckI8Size);
StaticAssert(sizeof(i16) == 2, CheckI16Size);
StaticAssert(sizeof(i32) == 4, CheckI32Size);
StaticAssert(sizeof(i64) == 8, CheckI64Size);
StaticAssert(sizeof(u8 ) == 1,  CheckU8Size);
StaticAssert(sizeof(u16) == 2, CheckU16Size);
StaticAssert(sizeof(u32) == 4, CheckU32Size);
StaticAssert(sizeof(u64) == 8, CheckU64Size);
StaticAssert(sizeof(iptr) == ARCH_SIZE/8, CheckIPTRSize);
StaticAssert(sizeof(uptr) == ARCH_SIZE/8, CheckUPTRSize);

#define  I8(x) (x)
#define I16(x) (x)
#define I32(x) (x)
#define I64(x) (x ## LL)
#define  U8(x) (x)
#define U16(x) (x)
#define U32(x) (x ## U)
#define U64(x) (x ## ULL)

#ifdef LANG_C
#define false 0
#define true  1
#endif

typedef i8 b8;
typedef i16 b16;
typedef i32 b32;
typedef i64 b64;

typedef float f32;
typedef double f64;

typedef void VoidFunc(void);
typedef void VoidFuncVoid(void*);

//~ NOTE(long): Basic Constants

#define MIN_I8  I8(0x80)
#define MIN_I16 I16(0x8000)
#define MIN_I32 I32(0x80000000)
#define MIN_I64 I64(0x8000000000000000)

#define MAX_I8  I8(0x7f)
#define MAX_I16 I16(0x7fff)
#define MAX_I32 I32(0x7fffffff)
#define MAX_I64 I64(0x7fffffffffffffff)

#define MAX_U8  U8(0xff)
#define MAX_U16 U16(0xffff)
#define MAX_U32 U32(0xffffffff)
#define MAX_U64 U64(0xffffffffffffffff)

#if ARCH_SIZE == 64
