/* date = July 24th 2022 6:30 pm */

#ifndef _BASE_H
#define _BASE_H

//~ TODO(long):
// [ ] Custom printf format
// [ ] Support for custom data structures

//~/////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
////////////////        BASE DECLARATION        ////////////////
////////////////////////////////////////////////////////////////
//-/////////////////////////////////////////////////////////////

//~ long: Base Setup

#ifndef BASE_LIB_EXPORT_SYMBOLS
#define BASE_LIB_EXPORT_SYMBOLS 0
#endif
#ifndef BASE_LIB_IMPORT_SYMBOLS
#define BASE_LIB_IMPORT_SYMBOLS 0
#endif
#ifndef BASE_LIB_RUNTIME_IMPORT
#define BASE_LIB_RUNTIME_IMPORT 0
#endif

#if BASE_LIB_EXPORT_SYMBOLS && BASE_LIB_IMPORT_SYMBOLS
#error BASE_LIB_EXPORT_SYMBOLS and BASE_LIB_IMPORT_SYMBOLS can't both be true
#endif

#if BASE_LIB_EXPORT_SYMBOLS
#define BASE_SHARABLE(name) libexport name
#elif BASE_LIB_IMPORT_SYMBOLS
#define BASE_SHARABLE(name) libimport name
#elif BASE_LIB_RUNTIME_IMPORT
#define BASE_SHARABLE(name) global (*name)
#else
#define BASE_SHARABLE(name) function name
#endif

#ifndef global
#define global static
#endif
#ifndef local
#define local static
#endif

#ifndef function
#define function static
#endif
#ifndef internal
#define internal static
#endif

//~ long: Context Cracking

//- long: Compiler
#if defined(__clang__)
#define COMPILER_CLANG 1
#elif defined(_MSC_VER)
#define COMPILER_CL 1
#elif defined(__GNUC__)

#define DeferBlock(begin, end) for (int UNIQUE(_i_) = ((begin), 0); UNIQUE(_i_) == 0; (UNIQUE(_i_) += 1), (end))

#define CheckNil(nil, p) ((p) == 0 || (p) == nil)

//~ long: Linked List Macros

#define DLLPushBack_NPZ(nil, f, l, n, next, prev) (CheckNil(nil, f) ? \
                                                   ((f)=(l)=(n), (n)->next=(n)->prev=(nil)) : \
                                                   ((l)->next=(n), (l)=(n), (n)->prev=(l), (n)->next=(nil)))
#define DLLPushBack_NP(f, l, n, next, prev) DLLPushBack_NPZ(0, f, l, next, prev)
#define DLLPushBack(f, l, n) DLLPushBack_NP(f, l, n, next, prev)
#define DLLPushFront(f, l, n) DLLPushBack_NP(l, f, n, prev, next)

#define DLLRemove_NPZ(nil, f, l, n, next, prev) ((f)==(n) ? \
                                                 ((f)==(l) ? ((f)=(l)=(nil)) : ((f)=(f)->next,(f)->prev=(nil))) : \
                                                 ((l)==(n) ? ((l)=(l)->prev,(l)->next=(nil)) : ((n)->next->prev=(n)->prev, \
                                                                                                (n)->prev->next=(n)->next)))
#define DLLRemove_NP(f, l, n, next, prev) DLLRemove_NPZ(0, f, l, n, next, prev)
#define DLLRemove(f, l, n) DLLRemove_NP(f, l, n, next, prev)

#define SLLQueuePush_N(f, l, n, next) (((f)==0 ? ((f)=(l)=(n)) : ((l)->next=(n),(l)=(n))), (n)->next=0)
#define SLLQueuePush(f, l, n) SLLQueuePush_N(f, l, n, next)

#define SLLQueuePushFront_N(f, l, n, next) ((f)==0 ? ((f)=(l)=(n), (n)->next=0) : ((n)->next=(f), (f)=(n)))
#define SLLQueuePushFront(f, l, n) SLLQueuePushFront_N(f, l, n, next)

#define SLLQueuePop_N(f, l, next) ((f)==(l) ? ((f)=(l)=0) : ((f)=(f)->next))
#define SLLQueuePop(f, l) SLLQueuePop_N(f, l, next)

#define SLLStackPush_N(f, n, next) ((n)->next=(f), (f)=(n))
#define SLLStackPush(f, n) SLLStackPush_N(f, n, next)

#define SLLStackPop_N(f, next) ((f)==0 ? 0 :((f)=(f)->next))
#define SLLStackPop(f) SLLStackPop_N(f, next)

//~ long: Basic Types

#if COMPILER_CL
// https://learn.microsoft.com/vi-vn/cpp/cpp/int8-int16-int32-int64?view=msvc-160
#define  __INT8_TYPE__ __int8
#define __INT16_TYPE__ __int16
#define __INT32_TYPE__ __int32
#define __INT64_TYPE__ __int64

// C:\Program Files (x86)\Microsoft Visual Studio\2019\Community\VC\Tools\MSVC\14.29.30133\include\vcruntime.h
#if ARCH_SIZE == 64
#define __INTPTR_TYPE__ __int64
#else
#define __INTPTR_TYPE__ __int32
#endif

#define   __UINT8_TYPE__ unsigned __INT8_TYPE__ 
#define  __UINT16_TYPE__ unsigned __INT16_TYPE__
#define  __UINT32_TYPE__ unsigned __INT32_TYPE__
#define  __UINT64_TYPE__ unsigned __INT64_TYPE__
#define __UINTPTR_TYPE__ unsigned __INTPTR_TYPE__
#endif

// https://github.com/gcc-mirror/gcc/blob/master/gcc/ginclude/stdint-gcc.h
// https://gcc.gnu.org/onlinedocs/cpp/Common-Predefined-Macros.html
typedef    __INT8_TYPE__ i8;
typedef   __INT16_TYPE__ i16;
typedef   __INT32_TYPE__ i32;
typedef   __INT64_TYPE__ i64;
typedef   __UINT8_TYPE__ u8;
typedef  __UINT16_TYPE__ u16;
typedef  __UINT32_TYPE__ u32;
typedef  __UINT64_TYPE__ u64;
typedef  __INTPTR_TYPE__ iptr;
typedef __UINTPTR_TYPE__ uptr;

StaticAssert(sizeof(i8 ) == 1,  CheckI8Size);
StaticAssert(sizeof(i16) == 2, CheckI16Size);
StaticAssert(sizeof(i32) == 4, CheckI32Size);
StaticAssert(sizeof(i64) == 8, CheckI64Size);
StaticAssert(sizeof(u8 ) == 1,  CheckU8Size);
StaticAssert(sizeof(u16) == 2, CheckU16Size);
StaticAssert(sizeof(u32) == 4, CheckU32Size);
StaticAssert(sizeof(u64) == 8, CheckU64Size);
StaticAssert(sizeof(iptr) == ARCH_SIZE/8, CheckIPTRSize);
StaticAssert(sizeof(uptr) == ARCH_SIZE/8, CheckUPTRSize);

#define  I8L(x) (x)
#define I16L(x) (x)
#define I32L(x) (x)
#define I64L(x) (x ## LL)
#define  U8L(x) (x)
#define U16L(x) (x)
#define U32L(x) (x ## U)
#define U64L(x) (x ## ULL)

#ifdef LANG_C
#define false 0
#define true  1
#endif

typedef i8  b8;
typedef i16 b16;
typedef i32 b32;
typedef i64 b64;

typedef u8  Flags8;
typedef u16 Flags16;
typedef u32 Flags32;
typedef u64 Flags64;

typedef float f32;
typedef double f64;

typedef void VoidFunc(void);
typedef void VoidFuncVoid(void*);

//~ long: Basic Constants

#define MIN_I8   I8L(0x80)
#define MIN_I16 I16L(0x8000)
#define MIN_I32 I32L(0x80000000)
#define MIN_I64 I64L(0x8000000000000000)

#define MAX_I8   I8L(0x7f)
#define MAX_I16 I16L(0x7fff)
#define MAX_I32 I32L(0x7fffffff)
#define MAX_I64 I64L(0x7fffffffffffffff)

#define MAX_U8   U8L(0xff)
#define MAX_U16 U16L(0xffff)
